clear all;
% variant 17
%численное решение
x10 = 1; x20 = 0; x30 = 0;
t_end = 30;
fun = @(t,x) [2*x(2); -1*x(1) + 0.5*x(3); -2*x(1)-4*x(2)-3*x(3)];
[t,X] = ode45(fun, [0 t_end], [x10, x20, x30]);
%аналитическое решение
x = zeros(length(t), 3);
x(:,1) = 0.114.*exp(-2.63*t) + 0.268.*exp(-0.185*t).*sin(1.73*t) + 0.886.*exp(-0.185*t).*cos(1.73*t);
x(:,2) = -0.153.*exp(-2.63*t) - 0.794.*exp(-0.185*t).*sin(1.73*t) + 0.153.*exp(-0.185*t).*cos(1.73*t);
x(:,3) = 1.04.*exp(-2.63*t) + 0.314.*exp(-0.185*t).*sin(1.73*t) - 1.04.*exp(-0.185*t).*cos(1.73*t);
%построение графиков
figure('color','white');
grid on; hold on;
plot(t,X, '-');
plot(t,x, '--', 'LineWidth',2);
xlabel('t,с');
ylabel('x_i(t)')
legend("X1 - численный", "X2 - численный", "X3 - численный","X1 - аналитический", "X2 - аналитический", "X3 - аналитический");